// ConsoleApplication1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include<iostream>
#include<windows.h>
#include<tchar.h>
#include<String>
#include <string>
#include <vector>
#include <string>
int main()
{
        cout << "Hello World!\n";
        cout << "Работу выполнила Арзамасова АВ группа 211-172" << endl;
        setlocale(LC_ALL, ""); //языковой пакет
        std::cout << "Fist string\n"; //для комментариев
        std::cout << "Первая строка\n"; // \n служит в качестве enter
        std::cout << "Вторая строка\n";
        int u = 10; //short, long, long long
        long long l = 123456789111111;
        std::cout << "l =" << l << "\n";
        std::cout << "u =" << u << "\n";
        float f = 2.2;
        double db = 3.3;
        unsigned int a = 3456789;
        bool b1 = true;
        bool b2 = false;
        char c = 'm'; // в char значение в одинарной кавычке
        char c2 = 104; // 104 код носит символ h
        std::cout << "c =" << c << "\n";
        std::cout << "c2 =" << c2 << "\n";
        int x = 150;
        float y = 15.993;
        char g = 250;
        std::cout << "Имя переменной x =" << x << "\n";
        std::cout << "Имя переменной y =" << y << "\n";
        std::cout << "Имя переменной g =" << g << "\n";
        int z = 29;
        int p = 02;
        int q = 2004;
        const float j = 2.3;
        std::cout << "Моя дата рождения: "; std::cout << "" << z << "."; std::cout << "" << p << "."; std::cout << "" << q << "\n";
        std::cout << "j =" << j << "\n";
        std::cout << "windows\n";
        }
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
